# GetSegmentData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalModelData..::..GetSegmentData Method
MEPAnalyticalModelData Class See Also
---
Gets the analysis data on the specified segment.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPNetworkSegmentData GetSegmentData(
	int segmentId
)
```

Visual Basic
---
```text
Public Function GetSegmentData ( _
	segmentId As Integer _
) As MEPNetworkSegmentData
```

Visual C++
---
```text
public:
MEPNetworkSegmentData^ GetSegmentData(
	int segmentId
)
```

# ### Parameters
segmentId
    Type: System..::..Int32 The segment id to be retrieved.
# ### Return Value
The calculated data of this segment. Be aware that the segment data may be invalid if the calculation failed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input must be a valid segment id. |

# See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace